# PointcloudtypeScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointcloudtypeScale Property
ParameterTypeId Class See Also
---
"Scale": The scale for this instance
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointcloudtypeScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointcloudtypeScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointcloudtypeScale {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace